In [2]:
import pandas as pd

In [3]:
data = {
    "Imię": ["Ala", "Bartek", "Celina"],
    "Wiek": [22, 25, 20],
    "Ocena": [4.5, 3.8, 5.0]
}
df = pd.DataFrame(data)
display(df)
print(df.describe())

     Imię  Wiek  Ocena
0     Ala    22    4.5
1  Bartek    25    3.8
2  Celina    20    5.0

            Wiek     Ocena
count   3.000000  3.000000
mean   22.333333  4.433333
std     2.516611  0.602771
min    20.000000  3.800000
25%    21.000000  4.150000
50%    22.000000  4.500000
75%    23.500000  4.750000
max    25.000000  5.000000

In [4]:
df['Rok Studiów'] = ['Pierwszy', 'Drugi', 'Trzeci']
display(df)

     Imię  Wiek  Ocena Rok Studiów
0     Ala    22    4.5    Pierwszy
1  Bartek    25    3.8       Drugi
2  Celina    20    5.0      Trzeci

In [5]:
srednia = df['Ocena'].mean()
print(srednia)

4.433333333333334

In [10]:
wybrane = df[df['Ocena'] > 4 ]
display(wybrane)

     Imię  Wiek  Ocena Rok Studiów
0     Ala    22    4.5    Pierwszy
2  Celina    20    5.0      Trzeci